tap "arl/arl"
tap "cloudflare/cloudflare"
tap "coder/coder"
tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "khanhas/tap"
tap "leoafarias/fvm"
tap "universal-ctags/universal-ctags"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Per-project, per-directory shell environments
brew "autoenv"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text processing scripting language
brew "awk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Google's own build tool
brew "bazel"
# Command-line automation tool
brew "bitrise"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Format bazel BUILD files with a standard convention
brew "buildifier"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Access VS Code through the browser
brew "code-server"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Classic UNIX line editor
brew "ed"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# C++ template library for linear algebra
brew "eigen"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc@6"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# International domain name library
brew "libidn"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Submit git branches to gerrit for review
brew "git-review"
# Official GitLab CI runner
brew "gitlab-runner"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Platform built on V8 to build network applications
brew "node"
# System monitoring dashboard for terminal
brew "gtop"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Simple terminal UI for git commands
brew "lazygit"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Pager program similar to more
brew "less"
# Portable sound library
brew "libmikmod"
# Postgres C API library
brew "libpq"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"
# Powerful paging program
brew "most"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Package for scientific computing with Python
brew "numpy"
# Create, run, and share large language models (LLMs)
brew "ollama", link: false
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Password manager
brew "pass"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Cross-platform library for real-time MIDI I/O
brew "portmidi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install various Ruby versions and implementations
brew "ruby-build"
# Safe, concurrent, practical language
brew "rust"
# SDL 1.2 compatibility layer that uses SDL 2.0 behind the scenes
brew "sdl12-compat"
# Image file loading library
brew "sdl_image"
# Sample multi-channel audio mixer library
brew "sdl_mixer"
# Library for using TrueType fonts in SDL applications
brew "sdl_ttf"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Framework and command-line tool for interacting with SourceKit
brew "sourcekitten"
# General framework for developing spatial indices
brew "spatialindex"
# Non-interactive SSH password auth
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", link: false
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# File synchronization tool
brew "unison"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Terminal based YouTube player and downloader
brew "yewtube"
# In terminal graphical metrics for your *nix system
brew "zenith"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# File transfer program
brew "zsync"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Provisions remote development environments via Terraform
brew "coder/coder/coder"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@31"
# SDK
brew "dart-lang/dart/dart"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Compare files and folders
cask "beyond-compare"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# App to build and share containerised applications and microservices
cask "docker"
# Tool to write Fedora images to portable media files
cask "fedora-media-writer"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu"
cask "font-ubuntu-mono-derivative-powerline"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
# Free and open-source media player
cask "kodi"
# Kubernetes IDE
cask "lens"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Home media player
cask "plex"
# Control your tools with a few keystrokes
cask "raycast"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Video game digital distribution service
cask "steam"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# App wrapper for music.youtube.com
cask "yt-music"
